#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bertelli/github-infra/runs/run-NmecBWht26SqKquX

Waiting for the plan to start...

Terraform v1.14.0
on linux_amd64
Initializing plugins and modules...
module.repositories["pink-killer"].github_repository.this: Refreshing state... [id=pink-killer]
module.repositories["arc-raiders-scripts"].github_repository.this: Refreshing state... [id=arc-raiders-scripts]
module.repositories["dota2-scripts"].github_repository.this: Refreshing state... [id=dota2-scripts]
module.branch_protection["dota2-scripts"].github_branch_protection.this: Refreshing state... [id=BPR_kwDOQhRHws4EMXva]
module.branch_protection["arc-raiders-scripts"].github_branch_protection.this: Refreshing state... [id=BPR_kwDOQZFaQc4EMX5M]
module.repositories["pink-killer"].github_repository.this: Drift detected (update)
╷
│ Warning: Deprecated attribute
│
│   on modules/repository/outputs.tf line 33, in output "default_branch":
│   33:   value       = github_repository.this.default_branch
│
│ The attribute "default_branch" is deprecated. Refer to the provider
│ documentation for details.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.branch_protection["tfm"].github_branch_protection.this will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }
    }

  # module.repositories["pink-killer"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ has_wiki                    = false -> true
        id                          = "pink-killer"
        name                        = "pink-killer"
        # (41 unchanged attributes hidden)
    }

  # module.repositories["tfm"].github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Node"
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tfm"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

      + security_and_analysis (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ protected_branches = {
      + tfm                 = {
          + pattern       = "main"
          + repository_id = (known after apply)
        }
        # (2 unchanged attributes hidden)
    }
  ~ repositories       = {
      + tfm                 = {
          + default_branch = (known after apply)
          + full_name      = (known after apply)
          + html_url       = (known after apply)
          + http_clone_url = (known after apply)
          + id             = (known after apply)
          + ssh_clone_url  = (known after apply)
        }
        # (3 unchanged attributes hidden)
    }
  ~ repository_urls    = {
      + tfm                 = (known after apply)
        # (3 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @zfael, Action: `pull_request`, Workflow: `Terraform`*